jantielens/esp32-template-wifi/src/app/image_api.cpp
/*
 * Image API Implementation
 * 
 * REST API handlers for uploading and displaying JPEG images.
 * Uses backend adapter pattern for portability across projects.
 */

#include "board_config.h"

#if HAS_IMAGE_API

#include "image_api.h"
#include "jpeg_preflight.h"
#include "log_manager.h"
#include "device_telemetry.h"

#include <Arduino.h>
#include <ESPAsyncWebServer.h>

#include <esp_heap_caps.h>
#include <soc/soc_caps.h>

static void* image_api_alloc(size_t size) {
    if (size == 0) return nullptr;

#if SOC_SPIRAM_SUPPORTED
    // Prefer PSRAM to reduce internal heap pressure when available.
    void* p = heap_caps_malloc(size, MALLOC_CAP_SPIRAM);
    if (p) return p;
#endif

    // Fallback: any 8-bit heap.
    // On some no-PSRAM boards, using INTERNAL|8BIT can exclude viable 8-bit regions.
    // Using 8BIT matches ESP.getFreeHeap() behavior and can reduce pressure on the
    // internal heap reserved for decode-time allocations.
    return heap_caps_malloc(size, MALLOC_CAP_8BIT);
}

static void image_api_free(void* p) {
    if (!p) return;
    heap_caps_free(p);
}

// ===== Constants =====

// Note: AsyncWebServer callbacks run on the AsyncTCP task. Do not block
// (e.g., with delay()/busy waits). If we're busy, return 409 and let the
// client retry.

// ===== Internal state =====

static ImageApiConfig g_cfg;
static ImageApiBackend g_backend = {nullptr, nullptr, nullptr};

// Image upload buffer (allocated temporarily during upload)
static uint8_t* image_upload_buffer = nullptr;
static size_t image_upload_size = 0;
static unsigned long image_upload_timeout_ms = 10000;

// Upload state tracking
enum UploadState {
    UPLOAD_IDLE = 0,
    UPLOAD_IN_PROGRESS,
    UPLOAD_READY_TO_DISPLAY
};
static volatile UploadState upload_state = UPLOAD_IDLE;
static volatile unsigned long pending_op_id = 0;  // Incremented when new op is queued

// Pending image display operation (processed by main loop)
struct PendingImageOp {
    uint8_t* buffer;
    size_t size;
    bool dismiss;  // true = dismiss current image, false = show new image
    unsigned long timeout_ms;  // Display timeout in milliseconds
    unsigned long start_time;  // Time when upload completed (for accurate timeout)
};
static PendingImageOp pending_image_op = {nullptr, 0, false, 10000, 0};

// Strip upload state (buffering during HTTP upload)
static uint8_t* current_strip_buffer = nullptr;
static size_t current_strip_size = 0;

// Strip processing state (async decode queue)
struct PendingStripOp {
    uint8_t* buffer;
    size_t size;
    uint8_t strip_index;
    int image_width;
    int image_height;
    int total_strips;
    unsigned long timeout_ms;
    unsigned long start_time;
};
static PendingStripOp pending_strip_op = {nullptr, 0, 0, 0, 0, 0, 10000, 0};

static bool is_jpeg_magic(const uint8_t* buf, size_t sz) {
    return (buf && sz >= 3 && buf[0] == 0xFF && buf[1] == 0xD8 && buf[2] == 0xFF);
}

static unsigned long parse_timeout_ms(AsyncWebServerRequest* request) {
    // Parse optional timeout parameter from query string (e.g., ?timeout=30)
    unsigned long timeout_seconds = g_cfg.default_timeout_ms / 1000;
    if (request->hasParam("timeout")) {
        String timeout_str = request->getParam("timeout")->value();
        timeout_seconds = (unsigned long)timeout_str.toInt();
        // Clamp to prevent overflow and respect max timeout
        unsigned long max_seconds = g_cfg.max_timeout_ms / 1000;
        if (timeout_seconds > max_seconds) timeout_seconds = max_seconds;
    }
    return timeout_seconds * 1000UL;
}

// ===== Handlers =====

// POST /api/display/image - Upload and display JPEG image (deferred decode)
static void handleImageUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    (void)filename;

    // First chunk - initialize upload
    if (index == 0) {
        // If upload already in progress OR pending display, reject (client can retry)
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Upload busy\"}");
            return;
        }

        Logger.logBegin("Image Upload");
        Logger.logLinef("Total size: %u bytes", request->contentLength());

        image_upload_timeout_ms = parse_timeout_ms(request);
        Logger.logLinef("Timeout: %lu ms", image_upload_timeout_ms);

        device_telemetry_log_memory_snapshot("img pre-clear");

        // Free any pending image buffer to make room for new upload
        if (pending_image_op.buffer) {
            Logger.logMessage("Upload", "Freeing pending image buffer");
            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
        }

        device_telemetry_log_memory_snapshot("img post-clear");

        // Check file size
        size_t total_size = request->contentLength();
        if (total_size > g_cfg.max_image_size_bytes) {
            Logger.logEnd("ERROR: Image too large");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Image too large\"}");
            return;
        }

        // Check memory availability.
        // - Upload uses a single contiguous buffer.
        // - The decode pipeline needs headroom (historically expressed via g_cfg.decode_headroom_bytes).

#if SOC_SPIRAM_SUPPORTED
        // `SOC_SPIRAM_SUPPORTED` means the SoC can use PSRAM, but some boards have no PSRAM fitted.
        // Use a runtime check so no-PSRAM boards don't take PSRAM-specific headroom gating.
        const bool has_psram = psramFound();
        const size_t psram_free = has_psram ? heap_caps_get_free_size(MALLOC_CAP_SPIRAM) : 0;
        const size_t psram_largest = has_psram ? heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM) : 0;
        const bool psram_can_hold_upload = has_psram && (psram_free >= total_size) && (psram_largest >= total_size);
#else
        const size_t psram_free = 0;
        const size_t psram_largest = 0;
        const bool psram_can_hold_upload = false;
#endif

        // PSRAM boards vs no-PSRAM boards behave very differently.
        // - On PSRAM boards: upload buffer is expected to land in PSRAM; keep an internal headroom guard.
        // - On no-PSRAM boards: keep the historical "total heap" guard (ESP.getFreeHeap) so we don't
        //   falsely reject when internal-only metrics look tight but the system can still operate.
#if SOC_SPIRAM_SUPPORTED
        if (has_psram) {
            const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (internal_free < g_cfg.decode_headroom_bytes) {
            Logger.logLinef(
                "ERROR: Insufficient internal memory for decode headroom (need %u, have %u)",
                (unsigned)g_cfg.decode_headroom_bytes,
                (unsigned)internal_free
            );
            device_telemetry_log_memory_snapshot("img insufficient");
            char error_msg[240];
            snprintf(
                error_msg,
                sizeof(error_msg),
                "{\"success\":false,\"message\":\"Insufficient internal memory: need %uKB decode headroom, have %uKB.\"}",
                (unsigned)(g_cfg.decode_headroom_bytes / 1024),
                (unsigned)(internal_free / 1024)
            );
            Logger.logEnd();
            request->send(507, "application/json", error_msg);
            return;
            }

